---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.IsValidCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
source: html/a8021755-2f5d-719b-23d5-a613ec5957a6.htm
---
# Autodesk.Revit.DB.ScheduleField.IsValidCombinedParameters Method

Checks if data is valid for combined parameters

## Syntax (C#)
```csharp
public bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
```

## Parameters
- **data** (`System.Collections.Generic.IList < TableCellCombinedParameterData >`) - data is array of TableCellCombinedParameterData to be set as combined parameters

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null